infrastructure/experiments/haproxy-old/roundrobin-1/ab_100_10.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.0.2 (be patient).....done


Server Software:        PIB
Server Hostname:        192.168.0.2
Server Port:            8080

Document Path:          /
Document Length:        2716 bytes

Concurrency Level:      10
Time taken for tests:   0.363 seconds
Complete requests:      100
Failed requests:        97
   (Connect: 0, Receive: 0, Length: 97, Exceptions: 0)
Total transferred:      288412 bytes
HTML transferred:       270212 bytes
Requests per second:    275.80 [#/sec] (mean)
Time per request:       36.259 [ms] (mean)
Time per request:       3.626 [ms] (mean, across all concurrent requests)
Transfer rate:          776.79 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    1   0.2      1       2
Processing:    15   32  10.4     29      71
Waiting:       15   32  10.4     29      71
Total:         16   33  10.4     31      72

Percentage of the requests served within a certain time (ms)
  50%     31
  66%     36
  75%     39
  80%     42
  90%     49
  95%     52
  98%     61
  99%     72
 100%     72 (longest request)
