infrastructure/experiments/haproxy-old/roundrobin-1/ab_10_1.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.0.2 (be patient).....done


Server Software:        PIB
Server Hostname:        192.168.0.2
Server Port:            8080

Document Path:          /
Document Length:        2716 bytes

Concurrency Level:      1
Time taken for tests:   0.151 seconds
Complete requests:      10
Failed requests:        9
   (Connect: 0, Receive: 0, Length: 9, Exceptions: 0)
Total transferred:      28994 bytes
HTML transferred:       27174 bytes
Requests per second:    66.43 [#/sec] (mean)
Time per request:       15.054 [ms] (mean)
Time per request:       15.054 [ms] (mean, across all concurrent requests)
Transfer rate:          188.09 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    1   0.1      1       1
Processing:    12   14   1.7     15      16
Waiting:       11   14   1.7     15      16
Total:         12   15   1.7     16      17

Percentage of the requests served within a certain time (ms)
  50%     16
  66%     16
  75%     17
  80%     17
  90%     17
  95%     17
  98%     17
  99%     17
 100%     17 (longest request)
